In [1]:
import numpy as np
import pandas as pd

from datetime import datetime

In [2]:
myyear = 2015
mymonth = 1
myday = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [3]:
mydate = datetime(myyear,mymonth,myday)

In [4]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [5]:
mydatetime = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [6]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [7]:
mydatetime.year

2015

In [18]:
myser = pd.Series(['Nov 3, 1990','2000-01-01',None])

In [19]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [16]:
myser[0].year

AttributeError: 'str' object has no attribute 'year'

In [20]:
pd.to_datetime(myser)

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [21]:
timeser = pd.to_datetime(myser)

In [22]:
timeser[0]

Timestamp('1990-11-03 00:00:00')

In [23]:
timeser[0].year

1990

In [24]:
obvi_euro_date = '31-12-2000'

In [27]:
pd.to_datetime(obvi_euro_date)

C:\Users\t0263316\AppData\Local\Temp\ipykernel_18472\163700324.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [31]:
euro_date = '10-12-2000'

In [33]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [36]:
style_date = '12--Dec--2000'

In [37]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [38]:
custom_date = "12th of Dec 2000"

In [40]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [49]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [50]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01         1509.0
1    1992-02-01         1541.0
2    1992-03-01         1597.0
3    1992-04-01         1675.0
4    1992-05-01         1822.0
..          ...            ...
373  2023-02-01         5071.0
374  2023-03-01         5645.0
375  2023-04-01         5641.0
376  2023-05-01         6185.0
377  2023-06-01         6158.0

[378 rows x 2 columns]

In [51]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
373    2023-02-01
374    2023-03-01
375    2023-04-01
376    2023-05-01
377    2023-06-01
Name: DATE, Length: 378, dtype: object

In [52]:
sales['DATE'] = pd.to_datetime(sales["DATE"])

In [53]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01         1509.0
1   1992-02-01         1541.0
2   1992-03-01         1597.0
3   1992-04-01         1675.0
4   1992-05-01         1822.0
..         ...            ...
373 2023-02-01         5071.0
374 2023-03-01         5645.0
375 2023-04-01         5641.0
376 2023-05-01         6185.0
377 2023-06-01         6158.0

[378 rows x 2 columns]

In [54]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
373   2023-02-01
374   2023-03-01
375   2023-04-01
376   2023-05-01
377   2023-06-01
Name: DATE, Length: 378, dtype: datetime64[ns]

In [55]:
sales['DATE'][0].year

1992

In [59]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [62]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
373   2023-02-01
374   2023-03-01
375   2023-04-01
376   2023-05-01
377   2023-06-01
Name: DATE, Length: 378, dtype: datetime64[ns]

In [63]:
sales = sales.set_index("DATE")

In [64]:
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3802.000000
2014-12-31    3945.750000
2015-12-31    4090.250000
2016-12-31    4273.750000
2017-12-31    4385.166667
2018-12-31    4586.916667
2019-12-31    4735.166667
2020-12-31    5528.750000
2021-12-31    5825.083333
2022-12-31    5861.000000
2023-12-31    5632.166667

In [65]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [66]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01         1509.0
1 1992-02-01         1541.0
2 1992-03-01         1597.0
3 1992-04-01         1675.0
4 1992-05-01         1822.0

In [67]:
sales['DATE'].dt.month

0      1
1      2
2      3
3      4
4      5
      ..
373    2
374    3
375    4
376    5
377    6
Name: DATE, Length: 378, dtype: int64